{
    "preview": [ 
        { 
            "condition": "hairpreview3",
            "who": "mom",
            "text": [ "Home sweet home"]
        },
        { 
            "condition": "hairpreview6",
            "who": "mom",
            "text": ["Ah i wish i had curly hair"] 
        },
        { 
            "condition": "toppreview3",
            "who": "mom",
            "text": ["Do you have any idea what it's like to see your dreams die", "because of a single mistake?"]
        },
        { 
            "condition": "toppreview5",
            "who": "gail",
            "text": ["You won't mind if I borrow something from your closet, right?"]
        }
    ],
    "click": [
        { 
            "on": "hair2",
            "who": "mom",
            "text":["Welcome home, Abigail.", "How was your time away?"]
        },
        { 
            "on": "hair3",
            "who": "mom",
            "text":[ "Isn't it a wonderful, bittersweet feeling","when people say we look so much alike?"]  
        },
        { 
            "on": "hair9",
            "who": "mom",
            "text":[ "This is where I feel closest to my old dreams","singing here in church.", "It's not the stage I imagined but it's a stage nonetheless."]  
        },
        { 
            "on": "top2",
            "who": "mom",
            "text": ["I gave up my entire future because of you,","and look what I got in return."] 
        },
        {
            "on": "top5",
            "who": "mom",
            "text":["Meanwhile, think about your behavior in the basement."]
        },
        {
            "on": "top6",
            "who": "mom",
            "text":["O Lord hear the cry of a girl", "for years of silence and fear have birthed within her a fury", "vast and ancient like the storms of old.", "Grant her solace for her anger is now a tempest beyond words,","a grief that knows no comfort.","May she find peace in Your embrace and let her soul be healed.", "Amen"]
        },
        { 
            "on": "bottom2",
            "who": "mom",
            "text": ["I tried to love you, I really did."] 
        },
        { 
            "on": "bottom4",
            "who": "mom",
            "text":[ "Yet the cruel, inevitable, and irredeemable truth", "is that a mistake is exactly what you are."]
        },
        { 
            "on": "hair3",
            "who": "gail",
            "text":[ "I'm so afraid of looking at myself in the mirror someday","and seeing your face staring back at me."]
        },
        { 
            "on": "top4",
            "who": "gail",
            "text":[ "My old school uniform. It doesn't fit anymore."]
        },
        { 
            "on": "top5",
            "who": "gail",
            "text":[ "I would gladly give you back my life", "so you could have yours", "But we don't always get what we want, do we?"]
        },
        { 
            "on": "bottom2",
            "who": "gail",
            "text":[ "Please stop yelling"]
        }
    ],
    "end1": [
        "\"Dear Abigail,",
        "I know these words will never reach you, and it's far too late to offer any apology, but I write them nonetheless, as a final confession.",
        "The devil took hold of me, and I became everything a mother shouldn't be — a vessel of cruelty and bitterness, chained to the bottle and lost to my own despair.",
        "From the day you were born, my hands, which should have offered comfort, instead brought pain, and for long years, that pain was all I gave you.",
        "You were right to leave, and in truth, I never wanted you to stay.",
        "I have confessed my sins and sought refuge in the Lord, though I fear His mercy is beyond my reach.",
        "May God grant you the peace I never could.",
        "Mother\""
    ],
    "end2": [
        "\"Once upon a time, there lived a young maiden with a heart full of dreams, a voice more charming than the morning birds, and a spirit that radiated joy.",
        "Her melodies flowed like rivers, filling the air with vibrant energy and uplifting everyone who listened. Her voice was her treasure and the source of her greatest hopes.",
        "One fateful day, a mysterious circus, with tents of deep crimson and gold, and performers who seemed to dance on the edge of reality itself, arrived at the town.",
        "Among them was a dashing young man, a circus artist with eyes as sharp as a hawk's and a smile as fleeting as the wind.",
        "He whispered promises of a shared future, bright, wild and free like the circus itself, of a life where her voice would be heard across the world.",
        "But soon, the young maiden discovered she was with child, and the warmth in his eyes turned to ice. ",
        "The once-charming whispers became distant echoes of lies, and as the season ended, the circus packed up and vanished into the mist,",
        "leaving her behind without a word, like a fading dream. Her once-bright dreams crumbled into dust. ",
        "As the life inside her grew, her voice dimmed, faltering until it became nothing more than a faint echo of what it once had been—a ghost haunting her from within.",
        "In the end, her voice was gone, and all that was left was a child born into the quiet void of her shattered dreams.\""
    ]

}